//
//  GLESUtils.h
//  ios-shader
//
//  Created by 王云刚 on 2020/4/7.
//  Copyright © 2020 王云刚. All rights reserved.
//
//
//                 .-~~~~~~~~~-._       _.-~~~~~~~~~-.
//             __.'              ~.   .~              `.__
//           .'//                  \./                  \\`.
//         .'//                     |                     \\`.
//       .'// .-~"""""""~~~~-._     |     _,-~~~~"""""""~-. \\`.
//     .'//.-"                 `-.  |  .-'                 "-.\\`.
//   .'//______.============-..   \ | /   ..-============.______\\`.
// .'______________________________\|/______________________________`.
//

#import <Foundation/Foundation.h>
#include <OpenGLES/ES2/gl.h>
#import <UIKit/UIKit.h>
#import <GLKit/GLKit.h>

// 顶点数据结构;
typedef struct {
    GLKVector3 positionCoords; // 顶点坐标;
    GLKVector3 normalCoords; // 法线坐标;
    GLKVector2 textureCoords; // 纹理坐标;
} VertexStruct;

static const VertexStruct vertices[] = {
    // X轴0.5处的平面;
    {{0.5f,   -0.5f,   0.5f}, {1,  0,  0}, {0, 0}},
    {{0.5f,   -0.5f,  -0.5f}, {1,  0,  0}, {0, 1}},
    {{0.5f,   0.5f,   -0.5f}, {1,  0,  0}, {1, 1}},
    {{0.5f,   0.5f,   -0.5f}, {1,  0,  0}, {1, 1}},
    {{0.5f,   0.5f,    0.5f}, {1,  0,  0}, {1, 0}},
    {{0.5f,   -0.5f,   0.5f}, {1,  0,  0}, {0, 0}},

    // X轴-0.5处的平面;
    {{-0.5f,  0.5f,   -0.5f}, {-1,  0,  0}, {1, 1}},
    {{-0.5f,  -0.5f,  -0.5f}, {-1,  0,  0}, {0, 1}},
    {{-0.5f,  -0.5f,   0.5f}, {-1,  0,  0}, {0, 0}},
    {{-0.5f,  -0.5f,   0.5f}, {-1,  0,  0}, {0, 0}},
    {{-0.5f,  0.5f,    0.5f}, {-1,  0,  0}, {1, 0}},
    {{-0.5f,  0.5f,   -0.5f}, {-1,  0,  0}, {1, 1}},

    // Y轴0.5处的平面;
    {{0.5f,   0.5f,   -0.5f}, {0,  1,  0}, {1, 1}},
    {{-0.5f,  0.5f,   -0.5f}, {0,  1,  0}, {0, 1}},
    {{-0.5f,  0.5f,   0.5f}, {0,  1,  0}, {0, 0}},
    {{-0.5f,  0.5f,   0.5f}, {0,  1,  0}, {0, 0}},
    {{0.5f,   0.5f,   0.5f}, {0,  1,  0}, {1, 0}},
    {{0.5f,   0.5f,   -0.5f}, {0,  1,  0}, {1, 1}},

    // Y轴-0.5处的平面;
    {{-0.5f,  -0.5f,  0.5f}, {0,  -1,  0}, {0, 0}},
    {{-0.5f,  -0.5f,  -0.5f}, {0,  -1,  0}, {0, 1}},
    {{0.5f,   -0.5f,  -0.5f}, {0,  -1,  0}, {1, 1}},
    {{0.5f,   -0.5f,  -0.5f}, {0,  -1,  0}, {1, 1}},
    {{0.5f,   -0.5f,  0.5f}, {0,  -1,  0}, {1, 0}},
    {{-0.5f,  -0.5f,  0.5f}, {0,  -1,  0}, {0, 0}},
    
    // Z轴0.5处的平面;
    {{-0.5f,   0.5f,  0.5f},  {0,  0,  1}, {0, 0}},
    {{-0.5f,  -0.5f,  0.5f},  {0,  0,  1}, {0, 1}},
    {{0.5f,   -0.5f,  0.5f},  {0,  0,  1}, {1, 1}},
    {{0.5f,   -0.5f,  0.5f},  {0,  0,  1}, {1, 1}},
    {{0.5f,   0.5f,   0.5f},  {0,  0,  1}, {1, 0}},
    {{-0.5f,  0.5f,   0.5f},  {0,  0,  1}, {0, 0}},

    // Z轴-0.5处的平面;
    {{0.5f,   -0.5f,  -0.5f}, {0,  0,  -1}, {1, 1}},
    {{-0.5f,  -0.5f,  -0.5f}, {0,  0,  -1}, {0, 1}},
    {{-0.5f,  0.5f,   -0.5f}, {0,  0,  -1}, {0, 0}},
    {{-0.5f,  0.5f,   -0.5f}, {0,  0,  -1}, {0, 0}},
    {{0.5f,   0.5f,   -0.5f}, {0,  0,  -1}, {1, 0}},
    {{0.5f,   -0.5f,  -0.5f},  {0,  0,  -1}, {1, 1}},
};

@interface GLESUtils : NSObject

+ (GLuint)loadShader:(GLenum)type withString:(NSString *)shaderString;
+ (GLuint)loadShader:(GLenum)type withFilepath:(NSString *)shaderFilepath;
+ (GLuint)loadProgram:(NSString *)vertexShaderFilepath withFragmentShaderFilepath:(NSString *)fragmentShaderFilepath;
+ (GLuint)fillTexture:(NSString *)fileName;

@end
